In [1]:
# !pip install sqlalchemy
# !pip install ipython-sql

In [2]:
%load_ext sql

In [3]:
import pandas as pd
import csv, sqlite3

In [4]:
con = sqlite3.connect("athletes.db")
cur = con.cursor()

In [5]:
%sql sqlite:///athletes.db

In [6]:
cur.execute('CREATE TABLE IF NOT EXISTS athletes (ID number, Name text, Sex char, Age int, Height number, Weight number, Team text, NOC text,  Games, text, Year int, Season text, City text, Sport text, Event text, Medal text)')
con.commit()

In [7]:
df = pd.read_csv('athlete_events.csv')
df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [8]:
df.shape

(271116, 15)

In [9]:
df = df.sample(frac=.2)
df.shape

(54223, 15)

In [10]:
df = df.sample(frac=.2)
df.shape

(10845, 15)

In [11]:
df = df.sample(frac=.2)
df.shape

(2169, 15)

In [12]:
df.to_sql('athletes', con, if_exists='replace', index = False)

2169

In [13]:
%sql SELECT * FROM athletes LIMIT 1;

 * sqlite:///athletes.db
Done.

[(11592, 'Aranka Binder', 'F', 26.0, 163.0, 47.0, 'Individual Olympic Athletes', 'IOA', '1992 Summer', 1992, 'Summer', 'Barcelona', 'Shooting', "Shooting Women's Air Rifle, 10 metres", 'Bronze')]

In [14]:
con.close()